read_verilog -sv testOut/nondeleyed_base/*.v
hierarchy -top prod
proc
opt
flatten
opt
write_verilog testOut/nondeleyed_base/prod.v
async2sync
dffunmap
scc
write_smt2 -wires testOut/nondeleyed_base/prod.smt
